Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation.GetLocalizationFile Method (String, String)
 Retrieves localization file from configured environment
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetLocalizationFile(
	string subPath,
	string messageFile
)
Public Shared Function GetLocalizationFile (
	subPath As String,
	messageFile As String
) As String
Parameters
subPath
Type: System.String
Possible sub folder of message file. Empty sub folder has no effect.
messageFile
Type: System.String
File name of message file.
Return Value
Type: String
localization file full path
See Also
Reference
StructuresInstallation Class
GetLocalizationFile Overload
Tekla.Structures.Dialog Namespace